# GetStartHandle Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarHandlesData..::..GetStartHandle Method
RebarHandlesData Class See Also
---
Gets the start handle tag.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public int GetStartHandle()
```

Visual Basic
---
```text
Public Function GetStartHandle As Integer
```

Visual C++
---
```text
public:
int GetStartHandle()
```

# ### Return Value
Returns the start handle tag.
# See Also
RebarHandlesData Class
Autodesk.Revit.DB.Structure Namespace